cases/impingmentFreezingJet2D/constant/solid/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1  -1 0 0 0 0];

internalField   uniform (0 0 0.001);

boundaryField
{
        "(left|right|solid_to_fluid)"
        {
            type            zeroGradient;
            value           $internalField;
        }
        "(front|back)"
        {
            type            wedge;
        }
}

// ************************************************************************* //
