cases/impingmentFreezingJet2D/system/Qfluid
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Calculates the second invariant of the velocity gradient tensor.

\*---------------------------------------------------------------------------*/

type            Q;
libs            ("libfieldFunctionObjects.so");

field           U;
region		fluid;
executeControl  writeTime;
writeControl    writeTime;

// ************************************************************************* //
