cases/impingmentFreezingJet2D/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;
 
vertices
(
(0 0 0)           // 0
(0.9490958105 	-0.04143841799 0) // 1
(0.9490958105 	0.04143841799 	0)// 2
(0 	0	1.5)            // 3
(0.9490958105  -0.04143841799 1.5) // 4
(0.9490958105  0.04143841799 1.5) // 5
(0.04995241107 -0.00218096936 0) // 6
(0.04995241107 0.00218096936 0) // 7
(0.04995241107 -0.00218096936 1.5) // 8
(0.04995241107 0.00218096936 1.5) // 9
(0 0 2)           // 10
(0.9490958105  -0.04143841799 2) // 11
(0.9490958105  0.04143841799 2)// 12
(0.04995241107 -0.00218096936 2) // 13
(0.04995241107 0.00218096936 2) // 14
(0 0 3.5)           // 15
(0.9490958105  -0.04143841799 3.5) // 16
(0.9490958105  0.04143841799 3.5)// 17
(0.04995241107 -0.00218096936 3.5) // 18
(0.04995241107 0.00218096936 3.5) // 19
);
 
blocks
(
hex (0 6 7 0 3 8 9 3) (130  1 210) simpleGrading (0.3 1 1)
hex (6 1 2 7 8 4 5 9) (260  1 210) simpleGrading (230 1 1)
hex (3 8 9 3 10 13 14 10) (130  1 70) simpleGrading (0.3 1 1)
hex (8 4 5 9 13 11 12 14) (260  1 70) simpleGrading (230 1 1)
hex (10 13 14 10 15 18 19 15) (130  1 100) simpleGrading (0.3 1 2)
hex (13 11 12 14 18 16 17 19) (260  1 100) simpleGrading (230 1 2)
);
 
edges
(
);
 
boundary
(
     front
     { 
           type wedge;
           faces  
           (
               (0 6 8 3)
	       (6 1 4 8)
               (3 8 13 10)
	       (8 4 11 13)
               (10 13 18 15)
	       (13 11 16 18)
           );
      }
     back
     { 
           type wedge;
           faces  
           (
               (0 7 9 3)
	       (7 2 5 9)
               (3 9 14 10)
	       (9 5 12 14)
               (10 14 19 15)
	       (14 12 17 19)
           );
      }
     bottomLeft
     { 
           type wall;//patch;
           faces  
           (
               (1 2 5 4)
           );
      }
     bottomRight
     { 
           type wall;//patch;
           faces  
           (
               (11 12 17 16)
           );
      }
     left
     { 
           type patch;
           faces  
           (
               (0 6 7 0)
               (6 1 2 7)
           );
      }
     right
     { 
           type patch;
           faces  
           (
               (15 18 19 15)
               (18 16 17 19)
           );
      }
     jet
     { 
           type patch;
           faces  
           (
               (4 5 12 11)
           );
      }
     axis
     { 
           type empty;
           faces  
           (
               (0 3 3 0)
               (3 10 10 3)
	       (10 15 15 10)
           );
      }
);
 
mergePatchPairs
(
);
// ************************************************************************* //
