cases/impingmentFreezingJet2D/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     chtMultiRegionFoam;

startFrom       latestTime;//startTime;

startTime       0;

stopAt          endTime;

endTime         40000;

deltaT          1;

writeControl    timeStep;//adjustableRunTime;

writeInterval   1000;

purgeWrite      0;

writeFormat     ascii;//binary;

writePrecision  11;

writeCompression on;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

//maxCo           10;

// Maximum diffusion number
//maxDi           10.0;

//adjustTimeStep  yes;

functions
{  #includeFunc wallHeatFluxFluid
   #includeFunc wallShearStress
   #includeFunc yPlus
   #includeFunc probes
   #includeFunc streamlines
   #includeFunc patchAverageSolid
   #includeFunc patchAverageFluid
//  #include "'patchAverage(name=jet,U) -region fluid'"
}

// ************************************************************************* //
