cases/impingmentFreezingJet2D/system/fluid/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
   "(p_rgh|rho).*"
    {
        solver           GAMG;
        smoother         GaussSeidel;
        tolerance        1e-11;
        relTol           0.001;
        maxIter          500;
    }
    "(U|h|k|omega).*"
    {
        solver           PBiCGStab;
        preconditioner   DILU;
        tolerance        1e-11;
        relTol           0.001;
    }

}

PIMPLE
{
    momentumPredictor   yes;
    nCorrectors         1;
    nNonOrthogonalCorrectors 0;
    residualControl
    {
        "p_rgh.*"           	      1e-8;
        "Uy.*"              	      1e-1;
        "(Ux|Uz).*"         	      1e-8;
        "(nut|k|omega).*"	      1e-8;
	"h.*"			      1e-8;
    }
}

relaxationFactors
{
    fields
    {
        "p_rgh.*"       0.3;
        "p_rgh.*"       0.3;
    }
    equations
    {
        "h.*"           0.3;
        "U.*"           0.3;
        "k.*"           0.3;
        "omega.*"       0.3;
        "nut.*"         0.3;
    }
}

// ************************************************************************* //
