cases/impingmentFreezingJet2D/system/fluid/surfaces
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out surface files with interpolated field data in VTK format, e.g.
    cutting planes, iso-surfaces and patch boundary surfaces.

    This file includes a selection of example surfaces, each of which the user
    should configure and/or remove.

\*---------------------------------------------------------------------------*/
type            surfaces;
libs            ("libsampling.so");
region          fluid;
writeControl    writeTime;

surfaceFormat   raw;
interpolationScheme face;

fields (p T wallHeatFlux wallShearStress yPlus);
surfaces
(
    CAD
    {
        type        patch;
        patches     (fluid_to_solid);
        interpolate false;
        
    }
);


// ************************************************************************* //
