cases/impingmentFreezingJet2D/system/patchAverageSolid
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Calculates the average value of one or more fields on a patch.

\*---------------------------------------------------------------------------*/

name    solid_to_fluid;
region	solid;
fields  (T);

operation areaAverage;
#includeEtc "caseDicts/postProcessing/surfaceFieldValue/patch.cfg"

// ************************************************************************* //
