cases/impingmentFreezingJet2D/system/sampleSolid
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    location        "system";
    object          sample;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type sets;
libs            ("libsampling.so");
region solid;
interpolationScheme cellPointFace;

setFormat raw;

sets
(
    z
    {
        type            lineFace;
        axis            xyz;
        start           (0 0 0);
        end             (0.1 0    3.5);
    }
);

fields
(
    T
);


// ************************************************************************* //
