cases/impingmentFreezingJet2D/system/solid/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

T
{
    internalField   uniform 274;

    boundaryField
    {
        left
        {
            type            fixedValue;
            value           uniform 274;
        }
        right
        {
            type            zeroGradient;
            value           $internalField;
        }
        "(front|back)"
        {
            type            wedge;
        }
        solid_to_fluid
        {
            type            compressible::turbulentTemperatureCoupledBaffleMixed;
            Tnbr            T;
            kappaMethod     solidThermo;
//            thicknessLayers (1e-3);
//            kappaLayers     (5e-4);
            value           $internalField;
        }
     }
}

//U
//{
//    internalField   uniform (0 0 1);
//
//    boundaryField
//    {
//        "(left|right|solid_to_fluid)"
//        {
//            type            zeroGradient;
//            value           $internalField;
//        }
//        "(front|back)"
//        {
//            type            wedge;
//        }
//     }
//}

// ************************************************************************* //
