cases/impingmentFreezingJet2D/system/solid/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "h.*"
    {
        solver           PBiCG;
        preconditioner   DILU;
        tolerance        1e-10;
        relTol           0.0001;
    }
}

PIMPLE
{
    nNonOrthogonalCorrectors 0;
    nCorrectors         1;
    residualControl
    {
        "U.*"               1e-8;
	"h.*"	            1e-8;
    }
}

relaxationFactors
{
    equations
    {
        "h.*"           0.3;
        "U.*"           0.3;
    }
}
// ************************************************************************* //
