cases/impingmentFreezingJet2D/system/streamlines
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out files of streamlines with interpolated field data in VTK format.

\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/postProcessing/visualization/streamlines.cfg"
fields  (U p T);
region fluid;
// Streamline direction: forward, backward, both
direction       both;

// Select from methods with sub-dictionary settings below
seedMethod      lineUniform;

// Seeding along a line

lineUniform
{
    type            lineUniform;
    start           (0.99 -0.0436 1.5);
    end             (0.99  0.0436 2);
    nPoints         50;
}

//triSurfaceMesh
//{
//    type            triSurfaceMesh;
//    surface         <surfaceMeshFile>; // in constant/triSurface directory
//}

// DO NOT REMOVE from END of file; sets the seedSampleSet
seedSampleSet
{
    ${$seedMethod};
    axis x;
}

// ************************************************************************* //
