cases/impingmentFreezingJet2D/system/wallHeatFluxFluid
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Calculates the heat-flux at wall patches, outputting the data as a
    volScalarField.

\*---------------------------------------------------------------------------*/

type            wallHeatFlux;
libs            ("libfieldFunctionObjects.so");
region 		fluid;
executeControl  writeTime;
writeControl    writeTime;

// ************************************************************************* //
